examples/turek/setup_files/openfoam2d/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "plate.*"
    {
        type zeroGradient;
    }
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    inlet
    {
        type zeroGradient;
    }
    cylinder
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }
    top
    {
        type zeroGradient;
    }
    frontAndBackPlanes
    {
        type empty;
    }
}

// ************************************************************************* //
