examples/turek/setup_files/openfoam2d/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        smoother         DICGaussSeidel;
    }

    "U.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "cellDisplacement.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          1e-0;
    }
}

PIMPLE
{
    nOuterCorrectors     50;
    nCorrectors          2;
    nNonOrthogonalCorrectors 1;
    outerCorrectorResidualControl
    {
        p
        {
             tolerance   1e-4;
             relTol      0;
        }
        U
        {
             tolerance   1e-4;
             relTol      0;
        }
    }
}

// ************************************************************************* //
